In [1]:
"""took an online course 'Foundation of Pandas Data Analysis' in www.inflearn.com """
import pandas as pd

In [2]:
# pandas is much faster than excel
# pandas uses numpy to compute numbers -> fast performance
data_frame = pd.read_csv('friend_list.csv')

In [3]:
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [4]:
data_frame.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [5]:
data_frame.tail()

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [6]:
# series = column
# dataframe is combination of the serieses 

type(data_frame.name) # type is series

pandas.core.series.Series

In [7]:
#how do we make series?
#by Python's list
list_tmp = [1,2,3]

In [8]:
list_tmp

[1, 2, 3]

In [9]:
#let's make series

#first column(=series)
s1 = pd.core.series.Series([1,2,3])

#second column(=series)
s2 = pd.core.series.Series(['one','two','three'])

In [10]:
# make dataframe by series
# combine series with header via dictionary
pd.DataFrame(data=dict(num=s1,word=s2))

   num   word
0    1    one
1    2    two
2    3  three

In [11]:
"""Lecture2 : Getting data from file"""

# check the version of pandas
#(you can substitute pip with conda if you are using Anaconda)

!pip list | grep pandas

pandas                                 0.23.1
You are using pip version 10.0.1, however version 18.0 is available.
You should consider upgrading via the 'pip install --upgrade pip' command.

In [12]:
# csv file : df = pd.read_csv("file_route")

# csv = txt
df = pd.read_csv('friend_list.txt')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [13]:
# csv != tab file
df = pd.read_csv('friend_list_tab.txt')
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [14]:
# designate delimiter as '\t'
df = pd.read_csv('friend_list_tab.txt', delimiter = '\t')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [15]:
 # if there is no header in data 
df = pd.read_csv('friend_list_no_head.csv')
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [16]:
# inform that there is no header
df = pd.read_csv('friend_list_no_head.csv',header=None)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [17]:
# then, add a header
df.columns = ['name','age','job']
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [18]:
# load and assign header at the same time
df = pd.read_csv('friend_list_no_head.csv', header=None, names = ['name','age','job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [19]:
""" Create DataFrame from your python code """

# Created List containing dictionary
friend_dict_list = [
    {'name':'John','age':25,'job':'student'},
    {'name':'Nate','age':30,'job':'teacher'}
]

# create DataFrame by List that I created
df = pd.DataFrame(friend_dict_list)
df

   age      job  name
0   25  student  John
1   30  teacher  Nate

In [20]:
# dictionary has no order(key order is not guaranteed) -> DataFrame header may not be in order
# so re-order the DataFrame
df = df[['name','age','job']]
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [21]:
# Or, there is another way to order the dictionary
# Use OrderedDict package

from collections import OrderedDict
# this guarantees key's order
friend_ordered_dict = OrderedDict(
    [
        ('name',['John','Nate']),
        ('age',[25,30]),
        ('job',['student','teacher'])
    ]
)

In [22]:
df = pd.DataFrame.from_dict(friend_ordered_dict)
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [23]:
friend_list = [
    ['John', 20,'student'],
    ['Nate',30, 'teacher'],
]

In [24]:
column_name = ['name', 'age', 'job']

In [25]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [26]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [27]:
friend_list = [
    ['name',['Jone','Nate']],
    ['age',[20,30]],
    ['job',['student','teacher']]
]

In [28]:
df = pd.DataFrame.from_items(friend_list)

/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

In [29]:
df.head()

   name  age      job
0  Jone   20  student
1  Nate   30  teacher

In [30]:
"""Write DataFrame To File"""
df.to_csv('friends.csv')

In [31]:
# 데이터만 csv에 넣고 싶다.
# na_rep = '-' 널값에는 대쉬를 대신 넣어라!
df.to_csv('friends.csv', index = False, header = False, na_rep = '-')

In [32]:
""" Dataframe row, column selection """

friend_list = [
    ['name',['John','Jenny','Nate']],
    ['age',[20,30,30]],
    ['job',['student','developer','teacher']]
]
df = pd.DataFrame.from_items(friend_list)

/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/ipykernel_launcher.py:8: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.

In [33]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [34]:
# 1번, 2번인덱스만 갖고온다.
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [35]:
df = pd.DataFrame.from_items(friend_list)
df

/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

### by column condition

In [37]:
# 나이가 스물 다섯살 이상인 데이터만 원해 !
df[df.age > 25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [39]:
# 또는 데이터베이스 쿼리처럼 .query라는 메소드를 써도 된다

df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [41]:
# 이번엔 두개의 조건! two conditon
# name = nate, age > 25

df[ (df.age > 25) & (df.name == 'Nate') ]

   name  age      job
2  Nate   30  teacher

## Filter Column

### by index

In [44]:
friend_list = [
    ['John', 20, 'student'],
    ['Jenny', 30, 'developer'],
    ['Nate', 30, 'teacher']
]
# make list into DataFrame
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [45]:
# 특정 칼럼만 인덱스로 필터링
# [모든row, 0번 칼럼부터 1번 칼럼까지]
df.iloc[:,0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [46]:
# filtering row index
df.iloc[0:2,0:2]

       0   1
0   John  20
1  Jenny  30

## by column name

In [48]:
df = pd.read_csv('friend_list_no_head.csv', header=None, names=['name','age','job'])

In [49]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [50]:
#filter 'job'
df_filtered = df[['name', 'age']]
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [51]:
# use '.filter(items=[])' function
df.filter(items=['age','job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [52]:
# 칼럼에서 'a'만 들어가는 데이터만 갖고싶어
# .filter(like='',axis=1) 축은 칼럼!(칼럼은 언제나 axis=1이다.)
df.filter(like='a',axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [53]:
# b로 끝나는 칼럼만 regex(정규식)으로 표현
df.filter(regex='b$',axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

# Drop row or column

In [55]:
friends = [{'age':15, 'job':'student'},
           {'age':25, 'job':'developer'},
           {'age':30, 'job':'teacher'}
          ]
df = pd.DataFrame(friends, index=['John','Jenny','Nate'], columns=['age','job'])

In [56]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

### drop data by name(index)

In [57]:
# John 과 Nate를 삭제하기
# .drop([index1,index2 ...])

df.drop(['John','Nate'])

       age        job
Jenny   25  developer

In [58]:
# 실제 df에서는 삭제되지 않는다.
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [60]:
# update the deletion on the DataFrame
df = df.drop(['John','Nate'])

In [61]:
df

       age        job
Jenny   25  developer

In [62]:
# 일단 다시 복원
df = pd.DataFrame(friends, index=['John','Jenny','Nate'], columns=['age','job'])

In [63]:
# Attribute 'inplace' can be applied into DataFrame DIRECTLY
df.drop(['John','Nate'], inplace=True)

In [64]:
# 따로 assign하지 않아도 바로 반영
df

       age        job
Jenny   25  developer

In [66]:
# Restore Data (again)
# assign index by integer (added Name as a column)
friends = [{'name':'John','age':15, 'job':'student'},
           {'name':'Ben','age':25, 'job':'developer'},
           {'name':'Jennt','age':30, 'job':'teacher'}
          ]
df = pd.DataFrame(friends, columns=['name','age','job'])

In [67]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jennt   30    teacher

### drop data by index(integer)

In [68]:
# delete John and Jenny
df = df.drop(df.index[[0,2]])

In [69]:
df

  name  age        job
1  Ben   25  developer

In [70]:
# restore data (again...)
df = pd.DataFrame(friends, columns=['name','age','job'])

### drop data by condition (조건으로 데이터 삭제하기)

In [71]:
# select the data that you want to keep
# 드롭하고 싶은 데이터는 선택하지 않는다
df = df[df.age > 20]

In [72]:
df

    name  age        job
1    Ben   25  developer
2  Jennt   30    teacher

In [73]:
# restore data
df = pd.DataFrame(friends, columns=['name','age','job'])

### drop data by column name (칼럼명으로 드롭하기)

In [74]:
# .drop('칼럼명', axis=1) 
df = df.drop('age', axis=1)
df

    name        job
0   John    student
1    Ben  developer
2  Jennt    teacher

In [75]:
# restore data
df = pd.DataFrame(friends, columns=['name','age','job'])

In [ ]:
# 이때도 inplace 이용하면 문장이 짧아진당
df.drop('age', axis=1, inplace=)